vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.SAML10_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         xmlns:saxon="http://saxon.sf.net//"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Keil</vendor>
   <url>https://www.keil.com/pack/</url>
   <name>SAML10_DFP</name>
   <description>Microchip SAML10 Series Device Support</description>
   <releases>
     <release version="1.0.135" date="2023-09-04" deprecated="2020-10-21">
	   This Software Pack is no longer maintained.
	   url uses https.
	 </release>
     <release version="1.0.134" date="2020-10-21" deprecated="2020-10-21">
       This pack is going to be deprecated. Device Support is maintained by Microchip going forward.
       Updated MDK Examples have been moved to respective board support packs (BSP) from Keil.
       Please remove this pack and install the following packs:
       - Microchip.SAML10_DFP.3.4.85.atpack and Keil.SAML10_BSP.1.0.0
      </release>
      <release version="1.0.133" date="2018-05-31">Initial version.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>SAML10</keyword>
   </keywords>
   <devices>
      <family Dfamily="SAML10" Dvendor="Microchip:3">
	    <description>
The Microchip SAM L10 family of microcontrollers is based on the Arm Cortex-M23 core.
It is ultra-low power and offers latest generation Peripheral Touch Controller (PTC) for capacitive touch capabilities.
The PTC adds Driven Shield Plus to provide superior water tolerance and excellent noise immunity enabling elegant touch interfaces.
The SAML10/L11 family is ideal for a myriad of IoT and security, automotive, appliance, medical and consumer applications whether hardwired or battery powered.
        </description>
        <algorithm name="mdk/flash/ATSAML10_UROW.FLM"
                  start="0x00804000"
                  size="0x00000008"
                  default="0"/>                                                    <!-- added by ARM -->

        <debug defaultResetSequence="ResetSystem"/>

        <sequences>                                                                <!-- added by ARM -->
<!-- Reset Stuff -->
          <sequence name="ForceCoreHalt">
            <block>
              __var DHCSR_Addr = 0xE000EDF0;
              __var DCRSR_Addr = 0xE000EDF4;
              __var DCRDR_Addr = 0xE000EDF8;
            </block>

            <!-- wait until core has stopped -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0" timeout="100000"/>

            <block info="Halt core">
              Write32(DHCSR_Addr,0xA05F0003);                                  // halt core in any case
            </block>

            <block info="Update xPSR register">
              Write32(DCRDR_Addr, 0x01000000);
              Write32(DCRSR_Addr, 0x00010010);                                 // update xPSR register
            </block>
            <control while="(Read32(DHCSR_Addr) &amp; 0x00010000) == 0" timeout="100000"/>
          </sequence>

          <sequence name="ResetSystem"                   info="SYSRESETREQ">
            <block>
              __var AIRCR_Addr = 0xE000ED0C;
              __var DHCSR_Addr = 0xE000EDF0;

              __errorcontrol = 1;                                              // ignore errors
              Write32(AIRCR_Addr, 0x05FA0004);                                 // Execute SYSRESETREQ via AIRCR
              __errorcontrol = 0;                                              // check errors

              DAP_Delay(1000);                                                 // time for bootloader
            </block>

            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while="(Read32(DHCSR_Addr) &amp; 0x02000000) != 0" timeout="100000"/>

            <block>
              Sequence("ForceCoreHalt");                                       // halt the core
            </block>
          </sequence>

          <sequence name="ResetProcessor" disable="true" info="VECTRESET">
            <!-- ResetProcessor not available for CM23 -->
          </sequence>

          <sequence name="ResetHardware"                 info="HW RESET">
            <block>
              __var nReset      = 0x80;
              __var canReadPins = 0;

              canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);     // Deassert nRESET line
            </block>

            <control while="(DAP_SWJ_Pins(0x00, nReset, 0) &amp; nReset) == nReset" timeout="1000000"/>

            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>

            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>

            <control if="!canReadPins">
              <block>
                DAP_SWJ_Pins(nReset, nReset, 0);                               // Assert nRESET line
              </block>

              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>

            <!-- check if connection is used for target debug -->
            <control if="(__connection &amp; 0xFF) == 1">
              <block>
                Sequence("ForceCoreHalt");                                     // halt the core
              </block>
            </control>
          </sequence>
<!-- Reset Stuff -->

<!-- Stop After Bootloader -->
          <sequence name="ResetCatchSet">
            <block>
              __var DHCSR_Addr    = 0xE000EDF0;
              __var DEMCR_Addr    = 0xE000EDFC;
              __var FP_CTRL_Addr  = 0xE0002000;
              __var FP_COMP0_Addr = 0xE0002008;
              __var FPB_KEY       = 0x00000002;
              __var FPB_ENABLE    = 0x00000001;
              __var value         = 0;
              __var resetVect     = 0x00000000;

