vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.SAML10_DFP.pdsc
   <boards>
    <board vendor="Microchip" name="SAML10-XPRO">
      <description>Microchip SAM L10 Xplained Pro Evaluation Kit</description>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAML10E16A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" Dfamily="SAM L10"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
	    <feature type="PWR"       n="5"              name="External Power"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="LED"       n="1"              name="Yellow User LED"/>
	    <feature type="CustomFF"  n="60" m="100"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>

   <examples>
    <!-- SAML10-XPRO Board -->
    <example name="Blinky" doc="Abstract.txt" folder="mdk/boards/Microchip/SAML10-XPRO/Blinky">
      <description>Blinky example</description>
	  <board name="SAML10-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
